{"Who Moved My Cheese?": {"Authors": ["Spencer Johnson", "Kenneth H. Blanchard"], "Description": "It is the amusing and enlightening story of four characters who live in a maze and look for cheese to nourish them and make them happy. Cheese is a metaphor for what you want to have in life, for example a good job, a loving relationship, money or possessions, health or spiritual peace of mind. The maze is where you look for what you want, perhaps the organisation you work in, or the family or community you live in. The problem is that the cheese keeps moving.  In the story, the characters are faced with unexpected change in their search for the cheese. One of them eventually deals with change successfully and writes what he has learned on the maze walls for you to discover.", "Genres": {"Nonfiction": 2114, "Self Help": 2061, "Business": 1945, "Psychology": 524, "Leadership": 385, "Personal Development": 322, "Management": 227, "Philosophy": 193, "Inspirational": 151}, "Recommended": ["Let's Talk: ...About Making Your Life Exciting, Easier, And Exceptional", "The Procrastination Cure: 21 Proven Tactics For Conquering Your Inner Procrastinator, Mastering Your Time, And Boosting Your Productivity!", "Grace: More Than We Deserve, Greater Than We Imagine", "The 7 Habits of Highly Effective People: Powerful Lessons in Personal Change", "Rich Dad, Poor Dad", "How to Win Friends and Influence People", "Master Your Emotions: A Practical Guide to Overcome Negativity and Better Manage Your Feelings", "Think and Grow Rich", "The Secret (The Secret, #1)", "The 4-Hour Workweek", "The One Minute Manager", "Tiny Habits: The Small Changes That Change Everything", "Hold Me Tight: Seven Conversations for a Lifetime of Love", "Good to Great: Why Some Companies Make the Leap... and Others Don't", "The Power of Habit: Why We Do What We Do in Life and Business", "Freakonomics: A Rogue Economist Explores the Hidden Side of Everything", "The Highly Sensitive Person: How to Thrive When the World Overwhelms You", "Start with Why: How Great Leaders Inspire Everyone to Take Action"], "URL": "https://www.goodreads.com/book/show/4894.Who_Moved_My_Cheese_"}, "Zero to One: Notes on Startups, or How to Build the Future": {"Authors": ["Peter Thiel", "Blake  Masters"], "Description": "If you want to build a better future, you must believe in secrets.  The great secret of our time is that there are still uncharted frontiers to explore and new inventions to create. In Zero to One, legendary entrepreneur and investor Peter Thiel shows how we can find singular ways to create those new things.   Thiel begins with the contrarian premise that we live in an age of technological stagnation, even if we’re too distracted by shiny mobile devices to notice. Information technology has improved rapidly, but there is no reason why progress should be limited to computers or Silicon Valley. Progress can be achieved in any industry or area of business. It comes from the most important skill that every leader must master: learning to think for yourself.  Doing what someone else already knows how to do takes the world from 1 to n, adding more of something familiar. But when you do something new, you go from 0 to 1. The next Bill Gates will not build an operating system. The next Larry Page or Sergey Brin won’t make a search engine. Tomorrow’s champions will not win by competing ruthlessly in today’s marketplace. They will escape competition altogether, because their businesses will be unique.   Zero to One presents at once an optimistic view of the future of progress in America and a new way of thinking about innovation: it starts by learning to ask the questions that lead you to find value in unexpected places.", "Genres": {"Business": 4761, "Nonfiction": 1128, "Entrepreneurship": 627, "Economics": 236, "Self Help": 234, "Science": 200, "Technology": 200, "Management": 169, "Leadership": 122, "Buisness": 111}, "Recommended": ["The Lean Startup: How Today's Entrepreneurs Use Continuous Innovation to Create Radically Successful Businesses", "How to Win Friends and Influence People", "The 4-Hour Workweek", "The Hard Thing About Hard Things: Building a Business When There Are No Easy Answers", "The Tipping Point: How Little Things Can Make a Big Difference", "Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future", "Business Model Generation", "Hooked: How to Build Habit-Forming Products", "Thinking, Fast and Slow", "The 7 Habits of Highly Effective People: Powerful Lessons in Personal Change", "Running Lean: Iterate from Plan A to a Plan That Works", "The Power of Positive Thinking", "Founders at Work: Stories of Startups' Early Days", "The One Minute Manager", "Rich Dad, Poor Dad", "Talking to Strangers: What We Should Know About the People We Don’t Know", "Steve Jobs", "Think and Grow Rich"], "URL": "https://www.goodreads.com/book/show/18050143-zero-to-one"}, "Bone: Quest for the Spark, Vol. 1": {"Authors": ["Tom Sniegoski", "Jeff Smith", "Thomas E. Sniegoski", "Steve Hamaker"], "Description": " A return to the enthralling world of BONE with book one in this gripping spin-off novel trilogy, illustrated in four-color!  Twelve-year-old Tom Elm is just an ordinary turnip farmer from the Valley, but he's always felt destined for something bigger. So when he discovers everyone in his village is asleep and plagued by nightmares, he assembles a band of unlikely heroes. They must fight to preserve the Spark--a divine light born at the core of a vast, dark nothingness called the Nacht. The Nacht is trying to permeate the Waking World with nightmares of the Dreaming, and it's Tom's mission to defeat the Nacht and its most loyal follower, the Constable. If he fails, his family--and everyone--might never wake up again.    ", "Genres": {"Sequential Art": 117, "Graphic Novels": 64, "Comics": 53, "Fantasy": 53, "Fiction": 19, "Adventure": 13, "Graphic Novels Comics": 9, "Humor": 9, "Childrens": 16, "Juvenile": 7}, "Recommended": ["Bone: Tall Tales", "Bone, Vol, 1: Out from Boneville (Bone, #1)", "The Adventures of Ook and Gluk: Kung Fu Cavemen from the Future", "Bone, Vol. 4: The Dragonslayer (Bone, #4)", "Bone, Vol. 9: Crown of Horns (Bone #9)", "Bone, Vol. 6: Old Man's Cave (Bone, #6)", "Rose (Bone, #0)", "The Stonekeeper (Amulet, #1)", "Big Nate: In a Class by Himself (Big Nate Novels, #1)", "Darth Paper Strikes Back (Origami Yoda #2)", "The Cloud Searchers (Amulet, #3)", "Jeff Smith: Bone and Beyond", "Bone, Vol. 8: Treasure Hunters (Bone, #8)", "Big Nate: From the Top", "Bone, Vol. 2: The Great Cow Race (Bone, #2)", "Lunch Lady and the Cyborg Substitute (Lunch Lady, #1)", "Bone: The Complete Edition", "The Wimpy Kid Movie Diary: How Greg Heffley Went Hollywood"], "URL": "https://www.goodreads.com/book/show/9366879-bone"}, "The Great Gatsby": {"Authors": ["F. Scott Fitzgerald", "Francis Scott Fitzgerald", "F. Scott Fitzgerald"], "Description": "Alternate Cover Edition ISBN: 0743273567 (ISBN13:  9780743273565 )  The Great Gatsby, F. Scott Fitzgerald's third book, stands as the supreme achievement of his career. This exemplary novel of the Jazz Age has been acclaimed by generations of readers. The story is of the fabulously wealthy Jay Gatsby and his new love for the beautiful Daisy Buchanan, of lavish parties on Long Island at a time when The New York Times noted \"gin was the national drink and sex the national obsession,\" it is an exquisitely crafted tale of America in the 1920s.  The Great Gatsby is one of the great classics of twentieth-century literature. (back cover)", "Genres": {"Classics": 44354, "Fiction": 20784, "Academic": 5049, "School": 3517, "Historical": 3297, "Historical Fiction": 3297, "Literature": 3259, "Romance": 2739, "Novels": 1854, "Read For School": 1532, "Young Adult": 1469, "High School": 1469}, "Recommended": ["To Kill a Mockingbird", "1984", "The Catcher in the Rye", "Animal Farm", "Pride and Prejudice", "Harry Potter and the Sorcerer's Stone (Harry Potter, #1)", "The Hunger Games (The Hunger Games, #1)", "Of Mice and Men", "Romeo and Juliet", "The Fault in Our Stars", "Lord of the Flies", "Jane Eyre", "Twilight (Twilight, #1)", "Fahrenheit 451", "Wuthering Heights", "The Help", "The Kite Runner", "The Diary of a Young Girl"], "URL": "https://www.goodreads.com/book/show/4671.The_Great_Gatsby"}, "The Worst Witch": {"Authors": ["Jill Murphy"], "Description": "Mildred Hubble is a trainee witch at Miss Cackle's Academy, and she's making an awful mess of it. She's always getting her spells wrong and she can't even ride a broomstick without crashing it. Will she ever make a real witch?", "Genres": {"Fantasy": 444, "Childrens": 339, "Fiction": 105, "Magic": 81, "Paranormal": 78, "Witches": 78, "Middle Grade": 64, "Classics": 33, "School Stories": 28, "Boarding School": 28, "Young Adult": 23}, "Recommended": ["The Twits", "The Hodgeheg", "Meg and Mog", "The Story of Tracy Beaker (Tracy Beaker, #1)", "The Enchanted Wood (The Faraway Tree, #1)", "George's Marvellous Medicine", "Double Act", "Charlie and the Chocolate Factory: A Play", "Fantastic Mr. Fox", "Mr. Majeika (Mr. Majeika, #1)", "The Queen's Nose", "The Witches: Plays for Children", "Gangsta Granny", "Fantastic Mr Fox", "The Witches", "The Loud House #2: There Will be MORE Chaos", "The Magic Faraway Tree (The Faraway Tree, #2)", "Isadora Moon Gets in Trouble"], "URL": "https://www.goodreads.com/book/show/351023.The_Worst_Witch"}, "The Death of the Author": {"Authors": ["Roland Barthes"], "Description": "\"The Death of the Author\" is a 1967 essay by the French literary critic and theorist Roland Barthes. Barthes's essay argues against traditional literary criticism's practice of incorporating the intentions and biographical context of an author in an interpretation of a text, and instead argues that writing and creator are unrelated.", "Genres": {"Nonfiction": 78, "Philosophy": 94, "Writing": 37, "Essays": 37, "Theory": 19, "Criticism": 32, "Literary Criticism": 18, "Cultural": 13, "France": 13, "Classics": 13, "Academic": 13}, "Recommended": ["What is an Author?", "The Laugh of the Medusa", "Structure, Sign, and Play", "The Intentional Fallacy", "Tradition and the Individual Talent: An Essay", "Exiting the Vampire Castle", "The Hollow Men", "Preface to the Lyrical Ballads", "Against Interpretation and Other Essays", "Art as Technique", "The Wife of Bath", "Groundwork of the Metaphysics of Morals", "Compulsory Heterosexuality and Lesbian Existence", "The Marriage of Heaven and Hell", "An Image of Africa", "The Man of the Crowd", "The Work of Art in the Age of Its Technological Reproducibility, and Other Writings on Media"], "URL": "https://www.goodreads.com/book/show/11289919-the-death-of-the-author"}, "The Omen": {"Authors": ["David Seltzer"], "Description": "Now updated, this classic tale of the antichrist who comes to Earth in the form of a young boy is available in time for 20th Century Fox's contemporary remake of the 1976 classic film, starring Liev Schreiber, Julia Stiles, and Mia Farrow, scheduled for release on June 6, 2006. Reissue.", "Genres": {"Horror": 965, "Fiction": 194, "Classics": 65, "Fantasy": 120, "Paranormal": 55, "Thriller": 51, "Supernatural": 31, "Mystery": 22, "Suspense": 19}, "Recommended": ["The Amityville Horror", "The Amityville Horror II", "The Exorcist", "Carrie / 'Salem's Lot / The Shining", "The Howling", "Jaws (Jaws #1)", "Audrey Rose", "Rosemary's Baby (Rosemary's Baby, #1)", "Halloween (Halloween #1)", "Psycho (Psycho #1)", "Misery", "Poltergeist", "The Shining", "It", "The Fog", "Suffer the Children", "The Silence of the Lambs  (Hannibal Lecter, #2)", "'Salem's Lot"], "URL": "https://www.goodreads.com/book/show/226162.The_Omen"}, "Flags of Our Fathers": {"Authors": ["James D. Bradley", "Ron Powers"], "Description": "In this unforgettable chronicle of perhaps the most famous moment in American military history, James Bradley has captured the glory, the triumph, the heartbreak, and the legacy of the six men who raised the flag at Iwo Jima. Here is the true story behind the immortal photograph that has come to symbolize the courage and indomitable will of America.  In February 1945, American Marines plunged into the surf at Iwo Jima—and into history. Through a hail of machine-gun and mortar fire that left the beaches strewn with comrades, they battled to the island's highest peak. And after climbing through a landscape of hell itself, they raised a flag.  Now the son of one of the flagraisers has written a powerful account of six very different young men who came together in a moment that will live forever.  To his family, John Bradley never spoke of the photograph or the war. But after his death at age seventy, his family discovered closed boxes of letters and photos. In  Flags of Our Fathers , James Bradley draws on those documents to retrace the lives of his father and the men of Easy Company. Following these men's paths to Iwo Jima, James Bradley has written a classic story of the heroic battle for the Pacific's most crucial island—an island riddled with Japanese tunnels and 22,000 fanatic defenders who would fight to the last man.  But perhaps the most interesting part of the story is what happened after the victory. The men in the photo—three were killed during the battle—were proclaimed heroes and flown home, to become reluctant symbols. For two of them, the adulation was shattering. Only James Bradley's father truly survived, displaying no copy of the famous photograph in his home, telling his son only: \"The real heroes of Iwo Jima were the guys who didn't come back.\"  Few books ever have captured the complexity and furor of war and its aftermath as well as  Flags of Our Fathers . A penetrating, epic look at a generation at war, this is history told with keen insight, enormous honesty, and the passion of a son paying homage to his father. It is the story of the difference between truth and myth, the meaning of being a hero, and the essence of the human experience of war.    From the Hardcover edition. ", "Genres": {"History": 915, "Nonfiction": 532, "War": 612, "Military Fiction": 208, "World War II": 196, "Biography": 107, "Military": 106, "Military History": 106, "North American Hi...": 84, "American History": 84, "Historical": 75}, "Recommended": ["Unbroken: A World War II Story of Survival, Resilience and Redemption", "Band of Brothers: E Company, 506th Regiment, 101st Airborne from Normandy to Hitler's Eagle's Nest", "The Pacific", "1776", "Black Hawk Down: A Story of Modern War", "Lost in Shangri-la: A True Story of Survival, Adventure, and the Most Incredible Rescue Mission of World War II", "Ghost Soldiers: The Epic Account of World War II's Greatest Rescue Mission", "Theodore Rex", "John Adams", "We Were Soldiers Once... and Young: Ia Drang - The Battle that Changed the War in Vietnam", "Lone Survivor: The Eyewitness Account of Operation Redwing and the Lost Heroes of SEAL Team 10", "The Longest Day", "The River of Doubt: Theodore Roosevelt's Darkest Journey", "American Sphinx: The Character of Thomas Jefferson", "American Sniper: The Autobiography of the Most Lethal Sniper in U.S. Military History", "D-Day, June 6, 1944: The Battle for the Normandy Beaches", "Citizen Soldiers: The US Army from the Normandy Beaches to the Bulge to the Surrender of Germany", "The Boys in the Boat: Nine Americans and Their Epic Quest for Gold at the 1936 Berlin Olympics"], "URL": "https://www.goodreads.com/book/show/10058.Flags_of_Our_Fathers"}, "Julie and Julia: 365 Days, 524 Recipes, 1 Tiny Apartment Kitchen": {"Authors": ["Julie Powell"], "Description": "With the humor of Bridget Jones and the vitality of Augusten Burroughs, Julie Powell recounts how she conquered every recipe in Julia Child's Mastering the Art of French Cooking and saved her soul!  Julie Powell is 30-years-old, living in a rundown apartment in Queens and working at a soul-sucking secretarial job that’s going nowhere. She needs something to break the monotony of her life, and she invents a deranged assignment. She will take her mother's dog-eared copy of Julia Child's 1961 classic Mastering the Art of French Cooking, and she will cook all 524 recipes. In the span of one year.   At first she thinks it will be easy. But as she moves from the simple Potage Parmentier (potato soup) into the more complicated realm of aspics and crépes, she realizes there’s more to Mastering the Art of French Cooking than meets the eye. With Julia’s stern warble always in her ear, Julie haunts the local butcher, buying kidneys and sweetbreads. She sends her husband on late-night runs for yet more butter and rarely serves dinner before midnight. She discovers how to mold the perfect Orange Bavarian, the trick to extracting marrow from bone, and the intense pleasure of eating liver.   And somewhere along the line she realizes she has turned her kitchen into a miracle of creation and cuisine. She has eclipsed her life’s ordinariness through spectacular humor, hysteria, and perseverance.", "Genres": {"Nonfiction": 1503, "Autobiography": 1025, "Memoir": 1025, "Food and Drink": 1297, "Food": 847, "Cooking": 338, "Biography": 304, "Womens Fiction": 186, "Chick Lit": 186, "Biography Memoir": 155, "Humor": 130, "Cookbooks": 112}, "Recommended": ["Under the Tuscan Sun", "Neither Here nor There: Travels in Europe", "My Life in France", "Eat, Pray, Love", "Toujours Provence", "In a Sunburned Country", "Marley and Me: Life and Love With the World's Worst Dog", "Bella Tuscany", "Betrayal of Faith (Zachary Blake Legal Thriller #1)", "Angela's Ashes (Frank McCourt, #1)", "Three Cups of Tea: One Man's Mission to Promote Peace ... One School at a Time", "Seabiscuit: An American Legend", "Encore Provence: New Adventures in the South of France", "Chocolat (Chocolat, #1)", "A Year in Provence", "Wild: From Lost to Found on the Pacific Crest Trail", "A Castle of Doomsday", "America's Daughter (Dancing Soul Trilogy, #2)"], "URL": "https://www.goodreads.com/book/show/13747.Julie_and_Julia"}, "The Girl with the Dragon Tattoo": {"Authors": ["Denise Mina", "Andrea Mutti", "Leonardo Manco"], "Description": "The official graphic novel adaptation of Stieg Larsson's THE GIRL WITH THE DRAGON TATTOO.  Harriet Vanger, a scion of one of Sweden's wealthiest families disappeared over forty years ago. All these years later, her aged uncle continues to seek the truth. He hires Mikael Blomkvist, a crusading journalist recently trapped by a libel conviction, to investigate. He is aided by the pierced and tattooed punk prodigy Lisbeth Salander. Together they tap into a vein of unfathomable iniquity and astonishing corruption.  This book combines materials that were separately published as  Book 1  and  Book 2 .", "Genres": {"Sequential Art": 53, "Graphic Novels": 36, "Comics": 17, "Fiction": 15, "Thriller": 9, "Mystery": 17, "Crime": 9, "Suspense": 4, "Graphic Novels Comics": 4, "Comics Manga": 2}, "Recommended": ["Angels and Demons / The Da Vinci Code (Robert Langdon, #1-2)", "The Girl With the Dragon Tattoo: Wiki content for your Kindle", "The Millennium Trilogy (Millennium Trilogy, #1-3)", "The Da Vinci Code (the Young Adult Adaptation)", "The Girl in the Spider's Web: by David Lagercrantz | Recap and Analysis", "Dan Brown Inferno (Robert Langdon) Unofficial Guide", "The Godfather", "Origin, Free Sampler (Robert Langdon)", "The DaVinci Code: A Quest for Answers", "Illuminating Angels  Demons: The Unauthorized Guide to the Facts Behind Dan Brown's Bestselling Novel", "Dan Brown's The Lost Symbol", "Memoirs of a Geisha", "Inferno: by Dan Brown -- Review", "Stieg Larsson Millennium Trilogy Collection 4 Books Set (The Girl with the Dragon Tattoo, The Girl Who Kicked the Hornets' Nest, The Girl Who Played with Fire, The Girl in the Spider's Web: Continuing Stieg Larsson's Millennium Series)", "Career of Evil: by Robert Galbraith | Summary & Analysis", "Harper Lee's To Kill a Mockingbird", "Khaled Hosseini's The Kite Runner (Bloom's Guides)"], "URL": "https://www.goodreads.com/book/show/18248517-the-girl-with-the-dragon-tattoo"}, "Homeric Hymns": {"Authors": ["Homer", "Jules Cashford", "Nicholas Richardson"], "Description": "Composed for recitation at festivals, these 33 songs were written in honour of the gods and goddesses of the ancient Greek pantheon. They recount the key episodes in the lives of the gods, and dramatise the moments when they first appear before mortals. Together they offer the most vivid picture we have of the Greek view of the relationship between the divine and human worlds.", "Genres": {"Poetry": 289, "Classics": 226, "Fantasy": 152, "Mythology": 152, "Fiction": 39, "Literature": 47, "Cultural": 23, "Greece": 23, "Religion": 21, "Ancient": 19, "Academic": 16, "School": 16}, "Recommended": ["Theogony / Works and Days", "Jason and the Golden Fleece (The Argonautica)", "Metamorphoses", "The Oresteia: Agamemnon, The Libation Bearers, The Eumenides", "Theogony", "Prometheus Bound", "The Bacchae", "Medea", "Sappho", "Hesiod and Theognis", "The Works and Days / Theogony / The Shield of Herakles", "Sophocles II: Ajax / Women of Trachis / Electra / Philoctetes (Complete Greek Tragedies, #4)", "The Library of Greek Mythology", "Eumenides (Ορέστεια, #3)", "Agamemnon (Oresteia, #1)", "Greek Tragedies, Volume 1: Aeschylus: Agamemnon, Prometheus Bound; Sophocles: Oedipus the King, Antigone; Euripides: Hippolytus", "Prometheus Bound and Other Plays", "Electra"], "URL": "https://www.goodreads.com/book/show/278316.Homeric_Hymns"}, "The Myth of Sisyphus and Other Essays": {"Authors": ["Albert Camus", "Justin O&#39;Brien"], "Description": "One of the most influential works of this century, this is a crucial exposition of existentialist thought. Influenced by works such as Don Juan, and the novels of Kafka, these essays begin with a meditation on suicide: the question of living or not living in an absurd universe devoid of order or meaning. With lyric eloquence, Camus posits a way out of despair, reaffirming the value of personal existence, and the possibility of life lived with dignity and authenticity.", "Genres": {"Philosophy": 2524, "Nonfiction": 673, "Writing": 415, "Essays": 415, "Classics": 346, "Cultural": 203, "France": 203, "Literature": 167, "European Literature": 84, "French Literature": 84, "20th Century": 40, "Fantasy": 30, "Mythology": 30}, "Recommended": ["Being and Nothingness", "Nausea", "Being and Time", "Existentialism is a Humanism", "Thus Spoke Zarathustra", "Fear and Trembling", "Beyond Good and Evil", "Critique of Pure Reason", "The Metamorphosis", "An Enquiry Concerning Human Understanding", "Leviathan", "The Trial", "The Ethics of Ambiguity", "The Communist Manifesto", "The Symposium", "On the Genealogy of Morals", "Meditations"], "URL": "https://www.goodreads.com/book/show/11987.The_Myth_of_Sisyphus_and_Other_Essays"}}